DROP TABLE camels;

SHOW TABLES;
+-------------------------+
| Tables_in_Human_friends |
+-------------------------+
| animal_classes          |
| cats                    |
| dogs                    |
| donkeys                 |
| hamsters                |
| home_animals            |
| horses                  |
| packed_animals          |
+-------------------------+
8 rows in set (0,00 sec)

SELECT Name, Birthday, Commands FROM horses
    -> UNION SELECT  Name, Birthday, Commands FROM donkeys;
+--------------------+------------+----------------------------------------+
| Name               | Birthday   | Commands                               |
+--------------------+------------+----------------------------------------+
| Гром               | 2020-01-12 | бегом, шагом                           |
| Закат              | 2017-03-12 | бегом, шагом, хоп                      |
| Байкал             | 2016-07-12 | бегом, шагом, хоп, брр                 |
| Молния             | 2020-11-10 | бегом, шагом, хоп                      |
| Первый             | 2019-04-10 | NULL                                   |
| Второй             | 2020-03-12 |                                        |
| Третий             | 2021-07-12 |                                        |
| Четвертый          | 2022-12-10 | NULL                                   |
+--------------------+------------+----------------------------------------+
8 rows in set (0,02 sec)


