CREATE TEMPORARY TABLE animals AS 
    SELECT *, 'Лошади' as genus FROM horses
        UNION SELECT *, 'Ослы' AS genus FROM donkeys
        UNION SELECT *, 'Собаки' AS genus FROM dogs
        UNION SELECT *, 'Кошки' AS genus FROM cats
        UNION SELECT *, 'Хомяки' AS genus FROM hamsters;


SELECT * FROM animals;
/*
+----+----------+------------+---------------------------------+----------+--------+
| Id | Name     | Birthday   | Commands                        | Genus_id | genus  |
+----+----------+------------+---------------------------------+----------+--------+
|  1 | Гнедой   | 2020-01-12 | бегом, шагом                    |        1 | Лошади |
|  2 | Закат    | 2017-03-12 | бегом, шагом, хоп               |        1 | Лошади |
|  3 | Байкал   | 2016-07-12 | бегом, шагом, хоп, брр          |        1 | Лошади |
|  4 | Молния   | 2020-11-10 | бегом, шагом, хоп               |        1 | Лошади |
|  1 | Гиббон   | 2019-04-10 | NULL                            |        2 | Ослы   |
|  2 | Макака   | 2020-03-12 |                                 |        2 | Ослы   |
|  3 | Горилла  | 2021-07-12 |                                 |        2 | Ослы   |
|  4 | Шампанзе | 2022-12-10 | NULL                            |        2 | Ослы   |
|  1 | Грей     | 2020-01-01 | ко мне, лежать, лапу, голос     |        2 | Собаки |
|  2 | Граф     | 2021-06-12 | сидеть, лежать, лапу            |        2 | Собаки |
|  3 | Шарик    | 2018-05-01 | сидеть, лежать, лапу, след, фас |        2 | Собаки |
|  4 | Бакс     | 2021-05-10 | сидеть, лежать, фу, место       |        2 | Собаки |
|  1 | Яша      | 2018-01-01 | кс-кс-кс                        |        1 | Кошки  |
|  2 | Пуся     | 2016-01-01 | сюда                            |        1 | Кошки  |
|  3 | Ляля     | 2010-01-01 | кушать                          |        1 | Кошки  |
|  1 | Хома     | 2020-10-12 | в норку                         |        3 | Хомяки |
|  2 | Пушистый | 2021-03-12 | атака сверху                    |        3 | Хомяки |
|  3 | Ниндзя   | 2022-07-11 | NULL                            |        3 | Хомяки |
|  4 | Бурый    | 2022-05-10 | NULL                            |        3 | Хомяки |
+----+----------+------------+---------------------------------+----------+--------+
*/

CREATE TABLE yang_animal AS
    SELECT Name, Birthday, Commands, genus, TIMESTAMPDIFF(MONTH, Birthday, CURDATE()) AS Age_in_month
    FROM animals 
    WHERE Birthday BETWEEN ADDDATE(curdate(), INTERVAL -3 YEAR) 
    AND ADDDATE(CURDATE(), INTERVAL -1 YEAR);

SELECT * FROM yang_animal;
/*
+----------+------------+---------------------------+--------+--------------+
| Name     | Birthday   | Commands                  | genus  | Age_in_month |
+----------+------------+---------------------------+--------+--------------+
| Молния   | 2020-11-10 | бегом, шагом, хоп         | Лошади |           32 |
| Горилла  | 2021-07-12 |                           | Ослы   |           24 |
| Граф     | 2021-06-12 | сидеть, лежать, лапу      | Собаки |           25 |
| Бакс     | 2021-05-10 | сидеть, лежать, фу, место | Собаки |           26 |
| Хома     | 2020-10-12 | в норку                   | Хомяки |           33 |
| Пушистый | 2021-03-12 | атака сверху              | Хомяки |           28 |
| Ниндзя   | 2022-07-11 | NULL                      | Хомяки |           12 |
| Бурый    | 2022-05-10 | NULL                      | Хомяки |           14 |
+----------+------------+---------------------------+--------+--------------+*/
